// 获取echarts的容器
var zuobiao = {
    '黑龙江': [127.9688, 45.368],
    '加拿大': [277.883154296875, 82.62866210937503],
    '内蒙古': [110.3467, 41.4899],
    "吉林": [125.8154, 44.2584],
    '北京市': [116.4551, 40.2539],
    "辽宁": [123.1238, 42.1216],
    "河北": [114.4995, 38.1006],
    "天津": [117.4219, 39.4189],
    "山西": [112.3352, 37.9413],
    "陕西": [109.1162, 34.2004],
    "甘肃": [103.5901, 36.3043],
    "宁夏": [106.3586, 38.1775],
    "青海": [101.4038, 36.8207],
    "新疆": [87.9236, 43.5883],
    "西藏": [91.11, 29.97],
    "四川": [103.9526, 30.7617],
    "重庆": [108.384366, 30.439702],
    "山东": [117.1582, 36.8701],
    "河南": [113.4668, 34.6234],
    "江苏": [118.8062, 31.9208],
    "安徽": [117.29, 32.0581],
    "湖北": [114.3896, 30.6628],
    "浙江": [119.5313, 29.8773],
    "福建": [119.4543, 25.9222],
    "江西": [116.0046, 28.6633],
    "湖南": [113.0823, 28.2568],
    "贵州": [106.6992, 26.7682],
    "云南": [102.9199, 25.4663],
    "广东": [113.12244, 23.009505],
    "广西": [108.479, 23.1152],
    "海南": [110.3893, 19.8516],
    '上海': [121.4648, 31.2891],
    '阿富汗': [74.89130859375001, 37.231640625],
    '安哥拉':  [12.947460937500011, -4.695312499999986],
    '阿尔巴尼亚': [19.851855468750017, 40.0435546875],
    '阿联酋':  [51.76757812500003, 24.25439453125],
    '阿根廷': [297.156640625, -21.997265625000026],
    '亚美尼亚': [45.5875, 40.846923828125],
    '澳大利亚':  [142.1310546875001, -10.640625],
    '奥地利': [13.785351562500011, 48.587451171874996],
    '阿塞拜疆': [46.67255859375004, 41.28681640625001],
    '布隆迪':   [29.403222656250023, -4.449316406250006],
    '比利时': [2.759375, 50.750634765624994],
    '贝宁': [1.624707031250011, 6.997314453125],
    '布基纳法':  [-3.527636718749989, 13.182714843749991],
    '孟加拉国': [88.76914062500006, 25.490478515625],
    '保加利亚':[22.452529688228115, 44.0510441391688],
    '巴哈马群岛': [-77.53466, 23.75975],
    '波黑': [16.53066406250008, 45.21669921875002],
    '白俄罗斯':  [26.457617187500006, 55.34248046875],
    '伯利兹':  [271.728271484375, 17.60986328125],
    '玻利维亚':  [302.283203125, -19.044042968750006],
    '巴西':  [299.257861328125, 5.202050781250037],
    '文莱': [114.0638671875, 4.592675781249966],
    '不丹': [90.63007812500001, 28.078564453124997],
    '博茨瓦纳': [19.98046875, -24.77675781250001],
    '中非共和国': [18.886035156250017, 8.836035156249991],
    '加拿大': [285.58583984375, 83.01313476562501],
    '瑞士': [9.524023437500006, 47.52421875],
    '智利':[291.515673828125, -20.628417968749957],
    '象牙海岸': [-2.856125, 4.994476],
    '喀麦隆': [14.243261718750006, 9.979736328125],
    '刚果（金）': [24.31982421875, 4.994140625],
    '刚果共和国': [16.610742187500023, 3.50537109375],
    '哥伦比亚':  [287.725, 11.88925781250002],
    '哥斯达黎加': [274.68544921875, 9.8109375],
    '古巴': [276.099267578125, 22.17011718750001],
    '北塞浦路斯':[32.94160156250001, 35.390429687499996],
    '塞浦路斯': [33.973617, 35.058506],
    '捷克共和国': [14.613574218750017, 50.85556640625],
    '德国':  [8.3798828125, 54.89985351562501],
    '吉布地': [43.081226, 12.699639],
    '丹麦': [10.753417968750028, 56.24199218749999],
    '多明尼加共和国': [288.23623046875, 18.20395507812499],
    '阿尔及利亚':  [2.593359375, 36.60068359375],
    '厄瓜多尔': [281.8193359375, 0.968554687499974],
    '埃及':  [30.56298828125, 31.4169921875],
    '厄立特里亚': [42.37851562500006, 12.46640625],
    '西班牙': [-7.060986328124955, 43.55395507812503],
    '爱沙尼亚': [24.529101562500045, 58.35424804687497],
    '埃塞俄比亚': [37.6484375, 14.322558593750003],
    '芬兰': [21.59375, 69.273583984375],
    "斐济": [178.3736, -17.33992],
    '福克兰群岛':[302.208203125, -51.63613281249998],
    '法国': [3.27333984375008, 50.53154296875002],
    '加蓬':  [9.803906250000011, 0.998730468749997],
    '英国': [-1.571777343749972, 60.494433593750074],
    '佐治亚州': [41.554084, 41.535656],
    '加纳':  [-2.695849609374989, 9.481347656249994],
    '几内亚': [-13.759765625, 12.262353515624994],
    '冈比亚': [-16.351806640625, 13.34335937499999],
    '几内亚比绍': [-16.656933593749955, 12.364355468749991],
    '赤道几内亚': [10.790917968750023, 2.167578125],
    '希腊': [26.135351562499977, 41.3857421875],
    '格陵兰': [315.2705078125, 81.77983398437505],
    '危地马拉': [269.36591796875, 16.5107421875],
    '圭亚那': [299.982470703125, 8.54931640625],
    '洪都拉斯': [275.888671875, 15.492431640625],
    '克罗地亚': [16.516210937499977, 46.499902343749966],
    '匈牙利': [16.44287109375, 47.39951171875],
    '印度尼西亚':[97.3913085937501, 2.975292968749969],
    '印度': [74.52597656249995, 31.765136718750057],
    '爱尔兰': [-7.55039062499992, 54.767968749999966],
    '伊朗': [44.76513671875003, 37.142431640625006],
    '伊拉克':[45.36162109375002, 36.01533203125],
    '冰岛': [-20.20751953125, 66.10009765625],
    '以色列': [35.45058593750002, 31.479296875],
    '意大利':[12.267968750000023, 46.83588867187504],
    '牙买加': [282.63857421875, 17.833691406249997],
    '约旦': [35.572851562500006, 32.640869140625],
    '日本': [139.83544921874997, 42.278076171875],
    '哈萨克斯坦':  [82.76083984375012, 50.89335937500002],
    '肯尼亚': [34.39941406249997, 3.412695312500006],
    '吉尔吉斯斯坦':[70.61210937500002, 39.786767578124994],
    '柬埔寨': [106.39921875000007, 11.687011718750028],
    '科索沃': [20.76216, 42.05186],
    '科威特':  [47.64375, 30.097314453125023],
    '老挝': [101.70751953125, 22.486572265625],
    '黎巴嫩': [36.50439453125, 34.432373046875],
    '利比里亚':   [-9.369140625, 7.703808593749997],
    '利比亚': [24.129687500000017, 32.009228515625],
    '斯里兰卡': [79.74980468750007, 8.294238281250003],
    '莱索托': [28.625781250000017, -28.58173828125001],
    '立陶宛': [22.731099, 54.327537],
    '卢森堡': [6.116503906250017, 50.120996093749994],
    '拉脱维亚':  [27.89208984375, 56.741064453125],
    '摩洛哥': [-7.142431640624949, 29.61958007812504],
    '摩尔多瓦': [28.729296875000017, 45.852001953125],
    '马达加斯加':  [48.796484375, -13.267480468750023],
    '墨西哥': [260.54345703125, 27.05668945312496],
    '马其顿': [21.05976562500001, 42.171289062499994],
    '马里': [-1.947900390624994, 23.124804687500003],
    '缅甸': [98.8322265625001, 23.624365234374977],
    '黑山共和国': [19.801613, 42.500093],
    '蒙古':  [113.04941406250003, 44.810351562499996],
    '莫桑比克': [35.37041015625002, -23.79824218750001],
    '毛里塔尼亚':[-6.594091796874977, 24.99462890624997],
    '马拉维': [34.32089843750006, -9.731542968749977],
    '马来西亚': [118.35312500000012, 5.80605468749998],
    '纳米比亚': [11.902539062500011, -17.2265625],
    '尼日尔': [1.300195312500023, 15.272265625],
    '尼日利亚': [3.695312499999972, 11.12031250000004],
    '尼加拉瓜':[276.7201171875, 14.812792968750003],
    '荷兰': [6.198828125000034, 51.45],
    '挪威': [23.94775390625, 79.19428710937498],
    '尼泊尔': [86.32861328125, 27.959521484374996],
    '新西兰':  [174.47558593750009, -36.94189453124997],
    '阿曼': [55.98515625000002, 24.063378906249966],
    '巴基斯坦': [68.59765625, 31.802978515625],
    '巴拿马”': [277.62919921875, 9.428564453124991],
    '秘鲁': [287.531005859375, -4.901269531250009],
    '菲律宾': [121.82519531250003, 18.842724609374983], 
    '巴布亚新几内亚':[147.20634765625007, -2.181933593749974],
    '波兰': [19.604394531250023, 54.4591796875],
    '波多黎各': [294.37119140625, 18.381396484375045],
    '北朝鲜': [130.640016, 42.395009],
    '葡萄牙': [-8.887597656249937, 41.76459960937501],
    '巴拉圭': [298.20146484375, -23.18203125],
    '卡塔尔':[50.8359375, 24.850390625],
    '罗马尼亚': [26.4423828125, 48.22998046875],
    '俄罗斯':  [57.858691406250074, 81.36806640625],
    '卢旺达': [29.390234375, -2.80859375],
    '西撒哈拉':  [-17.06396484375, 20.89882812499999],
    '沙特阿拉伯': [37.862890625, 30.44262695312503],
    '苏丹': [21.928125, 12.678125],
    '塞内加尔':  [-17.168066406249977, 14.640625],
    '所罗门群岛': [162.119025, -10.482719],
    '塞拉利昂': [-11.507519531249983, 6.906542968750003],
    '萨尔瓦多': [271.723779296875, 13.942675781250003],
    '索马里兰': [48.93813, 9.451749],
    '索马里': [41.341796875, 3.20166015625],
    '塞尔维亚': [22.767578125, 43.35415039062502],
    '苏里南': [302.668994140625, 5.020166015624994],
    '斯洛伐克': [18.0859375, 49.06513671875],
    '斯洛文尼亚':  [13.420996093750006, 46.212304687499994],
    '瑞典': [20.348046875000023, 68.84873046875003],
    '斯威士兰': [31.742578125000023, -27.30996093750001],
    '叙利亚': [37.90664062500002, 36.79462890625],
    '多哥': [1.62265625, 6.216796875],
    '泰国':  [98.59238281250006, 16.05068359375005],
    '塔吉克斯坦': [67.426171875, 39.46557617187497],
    '土库曼斯坦': [67.71904296875007, 39.62138671875002],
    '东帝汶': [124.968682, -8.89279],
    '突尼斯': [10.305273437500034, 33.72827148437497],
    '坦桑尼亚联合共和国': [33.903711, -0.95],
    '乌干达': [34.4072265625, 3.357519531249991],
    '乌克兰': [35.59111328125002, 50.36875],
    '乌拉圭': [301.91767578125, -32.893652343750006],
    '美国': [202.090625, 70.860107421875],
    '乌兹别克斯坦': [58.555273437500006, 45.55537109375001],
    '委内瑞拉': [299.53505859375, 7.166552734375045],
    '越南': [103.49296875000007, 22.587988281250034],
    '瓦努阿图': [167.844877, -16.466333],
    '也门':[42.79931640624997, 16.37177734375001],
    '南非':[28.05683593750001, -30.63105468750001],
    '赞比亚': [32.759375, -9.230599],
    '津巴布韦': [27.932226562500006, -16.89619140625001],
};
var dateList = [];
var newDataList = [];
var newData = []
var series = [];
var convertData = function (data) {
    var res = [];
    for (var i = 0; i < data.length; i++) {
        var dataItem = data[i];
        if(zuobiao[dataItem[0].name]) {
            var fromCoord = zuobiao[dataItem[0].name];//起点坐标
            var toCoord = zuobiao[dataItem[1].name];//终点坐标
            if (fromCoord && toCoord) {
                res.push([{
                    coord: fromCoord,
                    value: dataItem[0].value,
                    name: dataItem[0].name
                }, {
                    coord: toCoord,
                    name: dataItem[1].name
                }]);
            }
        }
    }
    return res;//线条数据
};
var myChart = echarts.init(document.getElementById("main"));

let mapFunc = function (json) {
        let oldDate = json[0].date;
        dateList.push(oldDate);
        let tempArray = [];
        for(let i=0;i<json.length;i++)
        {
            if(json[i].countryName=='不详') {
                continue;
            }
            if(zuobiao[json[i].countryName]) {
                if(oldDate!=json[i].date) {
                    oldDate = json[i].date;
                    dateList.push(oldDate);
                    newDataList.push(tempArray);
                    tempArray = [];
                    tempArray.push([
                        {
                            name: json[i].countryName,
                            value: Number(json[i].count),
                        },
                        {
                            name: json[i].provinceName
                        }
                    ]);
                }
                else {
                    tempArray.push([
                        {
                            name: json[i].countryName,
                            value: Number(json[i].count),
                        },
                        {
                            name: json[i].provinceName
                        }
                    ]);
                }
            }

        }
        newDataList.push(tempArray);
        for(let i=1;i<newDataList.length;i++) {
            for(let j=0;j<newDataList[i-1].length;j++) {
                let flag = 1;
                for(var k=0;k<newDataList[i].length;k++) {
                    if(newDataList[i-1][j][0].name==newDataList[i][k][0].name&&newDataList[i-1][j][1].name==newDataList[i][k][1].name) {
                        newDataList[i][k][0].value += newDataList[i-1][j][0].value;
                        flag = 0;
                    }
                }
                if(flag) {
                    newDataList[i].push(newDataList[i-1][j]);
                }
            }
        }
        console.log(newDataList);
        let temp = [[, newData]];
        temp.forEach(function (item, i) {
            series.push({
                // 设置连线
                type: 'lines',
                zlevel: 2,
                // effect: {
                //     show: true,
                //     period: 0, //箭头指向速度，值越小速度越快
                //     trailLength: 0.02, //特效尾迹长度[0,1]值越大，尾迹越长重
                //     symbol: 'arrow', //箭头图标
                //     symbolSize: 5, //图标大小
                // },
                lineStyle: {
                    normal: {
                        color: '#40E0D0',
                        width: 1, //线条宽度
                        opacity: 1, //线条透明度
                        curveness: .3 //线条曲直度
                    }
                },
                data: convertData(item[1])   //读数据
            },
            {
                //设置城市节点
                type: 'effectScatter',
                coordinateSystem: 'geo',
                zlevel: 2,
                // 设置节点标签
                label: {
                    normal: {
                        show: true,
                        position: 'right', //显示位置
                        offset: [2, -10], //城市名字偏移
                        color: '#00BFFF',
                        formatter: function (params) { //显示文字
                            return params.data.name;
                        },
                        fontSize: 10
                    },
                    emphasis: {
                        show: true
                    }
                },
                symbol: 'circle',
                symbolSize: 10,
                data: item[1].map(function (dataItem) {
                        return {
                            name: dataItem[0].name,
                            value: zuobiao[dataItem[0].name]
                        };
                }),
            }
            );
        });
        option = {
            tooltip: {
                trigger: 'item',
                backgroundColor: 'rgba(166, 200, 76, 0.82)',
                borderColor: '#FFFFCC',
                showDelay: 0,
                hideDelay: 0,
                enterable: true,
                transitionDuration: 0,
                extraCssText: 'z-index:100',
                formatter: function (params, ticket, callback) {
                    if(params.componentSubType=='lines') {
                        var res = "";
                        res = "<span style='color:#fff;'>" + params.data.fromName + '->' + params.data.toName + "</span><br/>：" + params.value;   //鼠标移动显示标签
                        return res;
                    }
                }
            },
            backgroundColor: "#013954",
            geo: {
                map: 'world',
                zoom: 5,
                center: [104.2978515625, 35.8544921875],
                label: {
                    emphasis: {
                        show: false
                    }
                },
                roam: true, //是否允许缩放
                itemStyle: {
                    normal: {
                        color: 'rgba(51, 69, 89, .5)', //地图背景色
                        borderColor: '#516a89', //省市边界线00fcff 516a89
                        borderWidth: 1
                    },
                    emphasis: {
                        color: 'rgba(37, 43, 61, .5)' //悬浮背景
                    }
                },
                regions: [
                    {
                        name: 'China',
                        itemStyle: {
                            normal: {
                                borderColor: '#0066ff',
                                borderWidth: 1,
                                // areaColor: '#00f',
                                areaColor: {
                                    type: 'linear',
                                    x: 0,
                                    y: 0,
                                    x2: 0,
                                    y2: 1,
                                    colorStops: [{
                                        offset: 0,
                                        color: 'rgb(23,44,60)' // 0% 处的颜色
                                    }, {
                                        offset: 1,
                                        color: 'rgb(3,101,100)' // 100% 处的颜色
                                    }],
                                    globalCoord: false
                                },
                                shadowColor: 'rgba(128, 217, 248, 1)',
                                shadowOffsetX: 0,
                                shadowOffsetY: 0,
                                shadowBlur: 10
                            },
                            emphasis: {
                                areaColor: '#389BB7',
                                borderWidth: 0
                            }
                        }
        
                    }
                ]
            },
            series: series
        };
        let newOption = {
            baseOption: {
                timeline: {
                    data: dateList,
                    axisType: 'category',
                    autoPlay: true,
                    playInterval: 1500,
                    left: '10%',
                    right: '10%',
                    bottom: '3%',
                    width: '80%',
                    //  height: null,
                    label: {
                        show: false,
                    },
                    symbolSize: 0,
                    lineStyle: {
                        color: '#555'
                    },
                    checkpointStyle: {
                        borderColor: '#777',
                        borderWidth: 2
                    },
                    controlStyle: {
                        showNextBtn: true,
                        showPrevBtn: true,
                        normal: {
                            color: '#666',
                            borderColor: '#666'
                        },
                        emphasis: {
                            color: '#aaa',
                            borderColor: '#aaa'
                        }
                    },
    
                },
                tooltip: {
                    trigger: 'item',
                    backgroundColor: 'rgba(166, 200, 76, 0.82)',
                    borderColor: '#FFFFCC',
                    showDelay: 0,
                    hideDelay: 0,
                    enterable: true,
                    transitionDuration: 0,
                    extraCssText: 'z-index:100',
                    formatter: function (params, ticket, callback) {
                        if(params.componentSubType=='lines') {
                            var res = "";
                            res = "<span style='color:#fff;'>" + params.data.fromName + '->' + params.data.toName + "</span><br/>：" + params.value;   //鼠标移动显示标签
                            return res;
                        }
                    }
                },
                backgroundColor: "#013954",
                geo: {
                    map: 'world',
                    zoom: 1.3,
                    center: [150.2978515625, 20.8544921875],
                    label: {
                        emphasis: {
                            show: false
                        }
                    },
                    roam: true, //是否允许缩放
                    itemStyle: {
                        normal: {
                            color: 'rgba(51, 69, 89, .5)', //地图背景色
                            borderColor: '#516a89', //省市边界线00fcff 516a89
                            borderWidth: 1
                        },
                        emphasis: {
                            color: 'rgba(37, 43, 61, .5)' //悬浮背景
                        }
                    },
                    regions: [
                        {
                            name: 'China',
                            itemStyle: {
                                normal: {
                                    borderColor: '#0066ff',
                                    borderWidth: 1,
                                    // areaColor: '#00f',
                                    areaColor: {
                                        type: 'linear',
                                        x: 0,
                                        y: 0,
                                        x2: 0,
                                        y2: 1,
                                        colorStops: [{
                                            offset: 0,
                                            color: 'rgb(23,44,60)' // 0% 处的颜色
                                        }, {
                                            offset: 1,
                                            color: 'rgb(3,101,100)' // 100% 处的颜色
                                        }],
                                        globalCoord: false
                                    },
                                    shadowColor: 'rgba(128, 217, 248, 1)',
                                    shadowOffsetX: 0,
                                    shadowOffsetY: 0,
                                    shadowBlur: 10
                                },
                                emphasis: {
                                    areaColor: '#389BB7',
                                    borderWidth: 0
                                }
                            }
            
                        }
                    ]
                },
                series: [
                    {
                        // 设置连线
                        type: 'lines',
                        zlevel: 2,
                        lineStyle: {
                            normal: {
                                color: '#40E0D0',
                                width: 1, //线条宽度
                                opacity: 1, //线条透明度
                                curveness: .3 //线条曲直度
                            }
                        },
                        // data: convertData(item[1])   //读数据
                    },
                    {
                        //设置城市节点
                        type: 'effectScatter',
                        coordinateSystem: 'geo',
                        zlevel: 2,
                        // 设置节点标签
                        label: {
                            normal: {
                                show: true,
                                position: 'right', //显示位置
                                offset: [2, -10], //城市名字偏移
                                color: '#00BFFF',
                                formatter: function (params) { //显示文字
                                    return params.data.name;
                                },
                                fontSize: 10
                            },
                            emphasis: {
                                show: true
                            }
                        },
                        symbol: 'circle',
                        symbolSize: 10,
                        // data: item[1].map(function (dataItem) {
                        //         return {
                        //             name: dataItem[0].name,
                        //             value: zuobiao[dataItem[0].name]
                        //         };
                        // }),
                    }
                ]
            },
            options: []
        }
        for(let i=0;i<newDataList.length;i++) {
            newOption.options.push({
                series: [
                    {
                        data: convertData(newDataList[i])
                    },
                    {
                        data: newDataList[i].map(function (dataItem) {
                            return {
                                name: dataItem[0].name,
                                value: zuobiao[dataItem[0].name]
                            };
                    }),
                    }
                ]
            })
        }
        myChart.setOption(newOption);
        window.addEventListener('resize', function () {
            myChart.resize();
        });
    }
mapFunc(yiqingData);
